In [1]:
%load_ext sql

C:\Users\SH\Anaconda3\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Users\SH\Anaconda3\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [2]:
%sql sqlite:///sample1.db

'Connected: None@sample1.db'

In [3]:
%sql select * from dept;

Done.

[(1, '영업', 8), (2, '기획', 10), (3, '개발', 9), (4, '총부', 7)]

In [4]:
%sql select * from emp;

Done.

[(4377, '이성래', '사장', None, 5000000, 2),
 (3426, '박영권', '과장', 4377, 3000000, 1),
 (3011, '이수민', '부장', 4377, 4000000, 3),
 (3427, '최종철', '사원', 3011, 1500000, 3),
 (1003, '조민희', '과장', 4377, 3000000, 2),
 (2106, '김창섭', '대리', 1003, 2500000, 2),
 (1365, '김상원', '사원', 3426, 1500000, 1)]

In [5]:
%sql sqlite:///sample2.db

'Connected: None@sample2.db'

In [6]:
%sql select * from student;

Done.

[(100, 'JONES', 'HISTORY', 'GR', 21),
 (150, 'PARKS', 'ACCOUNTING', 'SO', 19),
 (200, 'BAKER', 'MATH', 'GR', 50),
 (250, 'GLASS', 'HISTORY', 'SN', 50),
 (300, 'BAKER', 'ACCOUNTING', 'SN', 41),
 (350, 'RUSSEL', 'MATH', 'JR', 20),
 (400, 'RYE', 'ACCOUNTING', 'FR', 18),
 (450, 'JONES', 'HISTORY', 'SN', 24)]

In [7]:
%sql select * from class;

Done.

[('BA200', 'M-F9', 'SC110'),
 ('BD445', 'MWF3', 'SC213'),
 ('BF410', 'MWF8', 'SC213'),
 ('CS150', 'MWF3', 'EA304'),
 ('CS250', 'MWF12', 'EB210')]

In [8]:
%sql select * from enrollment;

Done.

[(100, 'BD445', 1),
 (150, 'BA200', 1),
 (200, 'BD445', 2),
 (200, 'CS250', 1),
 (300, 'CS150', 1),
 (400, 'BA200', 2),
 (400, 'BF410', 1),
 (400, 'CS250', 2),
 (450, 'BA200', 3)]

In [9]:
%sql sqlite:///sample3.db

'Connected: None@sample3.db'

In [10]:
%sql select * from s;

Done.

[('s01', 'Smith', 'London'),
 ('s02', 'jones', 'Paris'),
 ('s03', 'blakes', 'Paris'),
 ('s04', 'clark', 'London'),
 ('s05', 'adams', 'Athenes')]

In [11]:
%sql select * from p;

Done.

[('p01', 'Nut', 'red', 12, 'London'),
 ('p02', 'Bolt', 'green', 17, 'Paris'),
 ('p03', 'Screw', 'blue', 17, 'Rome'),
 ('p04', 'Screw', 'red', 14, 'London'),
 ('p05', 'cam', 'blue', 12, 'Paris'),
 ('p06', 'cog', 'red', 19, 'London')]

In [12]:
%sql select * from sp;

Done.

[('s01', 'p01', 300),
 ('s01', 'p02', 200),
 ('s01', 'p03', 400),
 ('s01', 'p04', 500),
 ('s01', 'p05', 100),
 ('s01', 'p06', 200),
 ('s02', 'p01', 300),
 ('s02', 'p02', 400),
 ('s03', 'p02', 200),
 ('s04', 'p04', 300),
 ('s05', 'p05', 400)]